app/controllers/beacon_controller.rb

INSERT INTO `urls` (`created_at`, `updated_at`, `url`) VALUES('2010-03-01 20:28:27', '2010-03-01 20:28:27', x'687474703a2f2f66726f6d74686f75676874327765622e636f6d2f')
SELECT * FROM `urls` WHERE (`urls`.`url` = 'http://fromthought2web.com/') LIMIT 1
INSERT INTO `yslow2s` (`url_id`, `ymindom`, `ycookiefree`, `w`, `yno404`, `created_at`, `ycsstop`, `yexpressions`, `details`, `yxhrmethod`, `updated_at`, `o`, `yjsbottom`, `ydns`, `yminify`, `yexternal`, `ip`, `r`, `ydupes`, `yetags`, `ymincookie`, `yfavicon`, `user_agent`, `s`, `lt`, `i`, `ycdn`, `yexpires`, `ycompress`, `yxhr`, `ynofilter`, `yimgnoscale`, `ynumreq`, `yredirects`) VALUES(1, 100, 0, 252664, 100, '2010-03-01 20:28:27', 100, 100, NULL, 100, '2010-03-01 20:28:27', 81, 100, 100, 100, NULL, NULL, 24, 100, 100, 100, 100, 'Mozilla/5.0 (Macintosh; U; Intel Mac OS X 10.5; en-US; rv:1.9.1.8) Gecko/20100202 Firefox/3.5.8', NULL, NULL, 'ydefault', 0, 0, 100, 100, 100, 100, 100, 100)
---
  def yslow
    raw = JSON.parse request.env['RAW_POST_DATA']

    raw_g = raw.delete('g') # grades

    attrs = {
      #:details=> raw_g,
      :user_agent=>request.headers['User-Agent']
    }

    raw.each { |k,v| # iterate over top level JSON keys
      attrs[k] =v
    }

    raw_g.each { |k,v| # iterate over nested yslow "grade" ("g") JSON keys
      attrs[k] =v['score']
    }

    site_url = CGI::unescape(attrs.delete('u'))
    site_url_clean = site_url.gsub("http://","")

    u = Url.find_or_create_by_url(site_url_clean)
    attrs[:url_id] = u.id

    y = Yslow2.new
    y.update_attributes(attrs)
    y.save

INSERT INTO `urls` (`created_at`, `updated_at`, `url`) VALUES('2010-03-01 21:55:36', '2010-03-01 21:55:36', x'687474703a2f2f636f64652e676f6f676c652e636f6d2f73706565642f706167652d73706565642f')
SELECT * FROM `urls` WHERE (`urls`.`url` = 'http://code.google.com/speed/page-speed/') LIMIT 1
INSERT INTO `page_speeds` (`url_id`, `v`, `pMinifyCSS`, `pParallelDl`, `pOptimizeTheOrderOfStylesAndScripts`, `w`, `l`, `pNoCookie`, `created_at`, `pCssInHead`, `pProxyCache`, `pDeferJS`, `pMinimizeRequestSize`, `pBrowserCache`, `pGzip`, `pScaleImgs`, `pSpecifyImageDimensions`, `updated_at`, `o`, `pCombineJS`, `pCssSelect`, `pMinifyJS`, `pPutCssInTheDocumentHead`, `ip`, `r`, `pCssJsOrder`, `user_agent`, `pMinRedirect`, `pAvoidBadRequests`, `pDupeRsrc`, `t`, `pCombineCSS`, `pUnusedCSS`, `pMinDns`, `pMinifyHTML`, `pOptImgs`, `pImgDims`, `pCookieSize`, `pCssExpr`, `pServeScaledImages`, `pSpecifyCharsetEarly`) VALUES(1, '1.6', 97.0, 100.0, 100.0, 343180, 942, 57.6, '2010-03-01 22:06:38', NULL, 97.9, 0.0, 100.0, 52.1, 99.0, NULL, 70.0, '2010-03-01 22:06:38', 89.0, 65.0, 16.0, 92.8, 100.0, NULL, 29, NULL, 'Mozilla/5.0 (Macintosh; U; Intel Mac OS X 10.5; en-US; rv:1.9.1.8) Gecko/20100202 Firefox/3.5.8', 100.0, 100.0, 100.0, 225920, 100.0, 86.4, 48.0, 99.0, 94.0, NULL, NULL, 100.0, 100.0, 100.0)
---
  def page_speed
    attrs = params.clone

    attrs[:user_agent] = request.headers['User-Agent']

    attrs.delete('action')
    attrs.delete('controller')

    u = Url.find_or_create_by_url(CGI::unescape attrs.delete('u'))
    attrs[:url_id] = u.id

    p = PageSpeed.new
    p.update_attributes(attrs)
    p.save