app/controllers/url_controller.rb

SELECT * FROM `urls`
SELECT * FROM `yslow2s` WHERE (`yslow2s`.url_id = 1) ORDER BY yslow2s.id DESC LIMIT 1
SELECT * FROM `page_speeds` WHERE (`page_speeds`.url_id = 1) ORDER BY page_speeds.id DESC LIMIT 1
SELECT count(*) AS count_all FROM `page_speeds` WHERE (`page_speeds`.url_id = 36)
SELECT count(*) AS count_all FROM `yslow2s` WHERE (`yslow2s`.url_id = 36)
---
  def index
    @urls = Url.find(:all)
    @grades = Hash.new { |hash,key| hash[key] = { } }

    @urls.each do |u|
      y = u.yslow2s.find(:last)
      p = u.page_speeds.find(:last)

SELECT * FROM `urls` WHERE (`urls`.`id` = 34)
SELECT * FROM `yslow2s` WHERE (`yslow2s`.url_id = 34)
---
  def show
    @url = Url.find(params[:id])
    @url_name = @url.url
    @yslow_scores = @url.yslow2s.find(:all)