app/controllers/url_controller.rb

SELECT * FROM `urls` ORDER BY created_at DESC LIMIT 0, 20
SELECT count(*) AS count_all FROM `urls`
---
  def index
    @urls = Url.paginate :page => params[:page], :order => 'created_at DESC'